martijnschouten/OCHVPS_FW/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name VDD5 (number 5), VDD_005
  @{ */
/* @} */

/*! @name VSS6 (number 6), VSS_006
  @{ */
/* @} */

/*! @name VDD16 (number 16), VDD_016
  @{ */
/* @} */

/*! @name VSS17 (number 17), VSS_017
  @{ */
/* @} */

/*! @name VSS22 (number 18), VSS_018
  @{ */
/* @} */

/*! @name VDDA (number 31), VDDA_031
  @{ */
/* @} */

/*! @name VSSA (number 34), VSSA_034
  @{ */
/* @} */

/*! @name VDD54 (number 43), VDD_043
  @{ */
/* @} */

/*! @name VSS55 (number 44), VSS_044
  @{ */
/* @} */

/*! @name VDD67 (number 56), VDD_056
  @{ */
/* @} */

/*! @name VSS68 (number 57), VSS_057
  @{ */
/* @} */

/*! @name VDD81 (number 70), VDD_070
  @{ */
/* @} */

/*! @name VSS82 (number 71), VSS_071
  @{ */
/* @} */

/*! @name RESET_b (number 74), RESET_b
  @{ */
/* @} */

/*! @name VSS104 (number 93), VSS_093
  @{ */
/* @} */

/*! @name VDD105 (number 94), VDD_094
  @{ */
/* @} */

/*! @name VSS118 (number 107), VSS_107
  @{ */
/* @} */

/*! @name VDD119 (number 108), VDD_108
  @{ */
/* @} */

/*! @name VSS137 (number 121), VSS_121
  @{ */
/* @} */

/*! @name VDD138 (number 122), VDD_122
  @{ */
/* @} */

/*! @name VSS150 (number 134), VSS_134
  @{ */
/* @} */

/*! @name VDD151 (number 135), VDD_135
  @{ */
/* @} */

/*! @name PORTA18 (number 72), EXTAL0
  @{ */

/* Symbols to be used with PORT driver */
#define EXTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define EXTAL0_PIN 18U                   /*!<@brief PORT pin number */
#define EXTAL0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA19 (number 73), XTAL0
  @{ */

/* Symbols to be used with PORT driver */
#define XTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define XTAL0_PIN 19U                   /*!<@brief PORT pin number */
#define XTAL0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name VREFH (number 32), VREFH_032
  @{ */
/* @} */

/*! @name VREFL (number 33), VREFL_033
  @{ */
/* @} */

/*! @name PORTA0 (number 50), JTAG_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_CLK_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_CLK_PIN 0U                   /*!<@brief PORT pin number */
#define JTAG_CLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA1 (number 51), JTAG_TDI
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TDI_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TDI_PIN 1U                   /*!<@brief PORT pin number */
#define JTAG_TDI_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA2 (number 52), JTAG_TDO
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TDO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TDO_PIN 2U                   /*!<@brief PORT pin number */
#define JTAG_TDO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA3 (number 53), JTAG_TMS
  @{ */

/* Symbols to be used with PORT driver */
#define JTAG_TMS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define JTAG_TMS_PIN 3U                   /*!<@brief PORT pin number */
#define JTAG_TMS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA14 (number 66), USB_UART_TX
  @{ */

/* Symbols to be used with PORT driver */
#define USB_UART_TX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define USB_UART_TX_PIN 14U                   /*!<@brief PORT pin number */
#define USB_UART_TX_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA15 (number 67), USB_UART_RX
  @{ */

/* Symbols to be used with PORT driver */
#define USB_UART_RX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define USB_UART_RX_PIN 15U                   /*!<@brief PORT pin number */
#define USB_UART_RX_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB2 (number 83), EEPROM_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define EEPROM_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define EEPROM_SCL_PIN 2U                   /*!<@brief PORT pin number */
#define EEPROM_SCL_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB3 (number 84), EEPROM_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define EEPROM_SDA_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define EEPROM_SDA_PIN 3U                   /*!<@brief PORT pin number */
#define EEPROM_SDA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE9 (number 12), PS_SW_STATE
  @{ */

