martijnschouten/OCHVPS_FW/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PS_SW_STATE_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define PS_SW_STATE_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PS_SW_STATE_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define PS_SW_STATE_PIN 9U                   /*!<@brief PORT pin number */
#define PS_SW_STATE_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE24 (number 45), PS_12V_VM
  @{ */

/* Symbols to be used with PORT driver */
#define PS_12V_VM_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PS_12V_VM_PIN 24U                   /*!<@brief PORT pin number */
#define PS_12V_VM_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC9 (number 114), PS_12V_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define PS_12V_EN_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define PS_12V_EN_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PS_12V_EN_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PS_12V_EN_PIN 9U                   /*!<@brief PORT pin number */
#define PS_12V_EN_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC10 (number 115), PS_12V_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define PS_12V_SCL_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define PS_12V_SCL_PIN 10U                   /*!<@brief PORT pin number */
#define PS_12V_SCL_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC11 (number 116), PS_12V_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define PS_12V_SDA_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define PS_12V_SDA_PIN 11U                   /*!<@brief PORT pin number */
#define PS_12V_SDA_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC8 (number 113), PS_HV_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define PS_HV_EN_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define PS_HV_EN_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PS_HV_EN_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PS_HV_EN_PIN 8U                   /*!<@brief PORT pin number */
#define PS_HV_EN_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name VBAT (number 42), VBAT_042
  @{ */
/* @} */

/*! @name PORTD0 (number 127), HB_LG1
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG1_PIN 0U                   /*!<@brief PORT pin number */
#define HB_LG1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD1 (number 128), HB_HG1
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG1_PIN 1U                   /*!<@brief PORT pin number */
#define HB_HG1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD2 (number 129), HB_LG2
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG2_PIN 2U                   /*!<@brief PORT pin number */
#define HB_LG2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD4 (number 131), HB_LG3
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG3_PIN 4U                   /*!<@brief PORT pin number */
#define HB_LG3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD3 (number 130), HB_HG2
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG2_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG2_PIN 3U                   /*!<@brief PORT pin number */
#define HB_HG2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD5 (number 132), HB_HG3
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG3_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG3_PIN 5U                   /*!<@brief PORT pin number */
#define HB_HG3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                        /* @} */

