martijnschouten/OCHVPS_FW/board/pin_mux.h
/*! @name PORTD6 (number 133), HB_LG4
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG4_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG4_PIN 6U                   /*!<@brief PORT pin number */
#define HB_LG4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD7 (number 136), HB_HG4
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG4_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG4_PIN 7U                   /*!<@brief PORT pin number */
#define HB_HG4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD8 (number 137), HB_LG5
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG5_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_LG5_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_LG5_PIN 8U                   /*!<@brief PORT pin number */
#define HB_LG5_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD9 (number 138), HB_HG5
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG5_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define HB_HG5_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define HB_HG5_PIN 9U                   /*!<@brief PORT pin number */
#define HB_HG5_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name PORTD10 (number 139), HB_LG6
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG6_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_LG6_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG6_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_LG6_PIN 10U                   /*!<@brief PORT pin number */
#define HB_LG6_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD11 (number 140), HB_HG6
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG6_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_HG6_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG6_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_HG6_PIN 11U                   /*!<@brief PORT pin number */
#define HB_HG6_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD12 (number 141), HB_LG7
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG7_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_LG7_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG7_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_LG7_PIN 12U                   /*!<@brief PORT pin number */
#define HB_LG7_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD13 (number 142), HB_HG7
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG7_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_HG7_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG7_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_HG7_PIN 13U                   /*!<@brief PORT pin number */
#define HB_HG7_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD14 (number 143), HB_LG8
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_LG8_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_LG8_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_LG8_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_LG8_PIN 14U                   /*!<@brief PORT pin number */
#define HB_LG8_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTD15 (number 144), HB_HG8
  @{ */

/* Symbols to be used with GPIO driver */
#define HB_HG8_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define HB_HG8_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define HB_HG8_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define HB_HG8_PIN 15U                   /*!<@brief PORT pin number */
#define HB_HG8_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTE25 (number 46), PS_HV_VM
  @{ */

/* Symbols to be used with PORT driver */
#define PS_HV_VM_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PS_HV_VM_PIN 25U                   /*!<@brief PORT pin number */
#define PS_HV_VM_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
